
## Plan Result

[CI link](https://github.com/shimizu-atsuyoshi/live-fire-exercise/actions/runs/18095595434)


<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.timezone_compute.aws_batch_compute_environment.this
  * module.timezone_compute.aws_batch_job_queue.this
  * module.timezone_job_definition.aws_batch_job_definition.this
* Update
  * module.bastion.aws_security_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.bastion.aws_security_group.this will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-08e12e4771c3c34ef"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "live-fire-exercise-bastion-sg"
        tags                   = {
            "Name" = "live-fire-exercise-bastion-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.timezone_compute.aws_batch_compute_environment.this will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn             = (known after apply)
      + ecs_cluster_arn = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + region          = "ap-northeast-1"
      + service_role    = "arn:aws:iam::891377385718:role/timezone-service-role"
      + state           = "ENABLED"
      + status          = (known after apply)
      + status_reason   = (known after apply)
      + tags_all        = (known after apply)
      + type            = "MANAGED"

      + compute_resources {
          + desired_vcpus = (known after apply)
          + max_vcpus     = 16
          + subnets       = [
              + "subnet-0290f4c50dc3b3bc4",
              + "subnet-05d662a6f1cbccf90",
              + "subnet-082bde1d43e8f5c4c",
            ]
          + type          = "FARGATE"

          + ec2_configuration (known after apply)
        }

      + update_policy (known after apply)
    }

  # module.timezone_compute.aws_batch_job_queue.this will be created
  + resource "aws_batch_job_queue" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "timezone"
      + priority = 1
      + region   = "ap-northeast-1"
      + state    = "ENABLED"
      + tags_all = {}

      + compute_environment_order {
          + compute_environment = (known after apply)
          + order               = 1
        }
    }

  # module.timezone_job_definition.aws_batch_job_definition.this will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + deregister_on_new_revision = true
      + ecs_properties             = jsonencode(
            {
              + taskProperties = [
                  + {
                      + containers       = [
                          + {
                              + command              = [
                                  + "/opt/timezone/batch",
                                ]
                              + environment          = [
                                  + {
                                      + name  = "TZ"
                                      + value = "Asia/Tokyo"
                                    },
                                ]
                              + image                = "timezone-batch"
                              + logConfiguration     = {
                                  + logDriver = "awslogs"
                                  + options   = {
                                      + awslogs-group         = "/aws/batch/timezone"
                                      + awslogs-region        = "ap-northeast-1"
                                      + awslogs-stream-prefix = "timezone-job"
                                    }
                                }
                              + name                 = "timezone"
                              + resourceRequirements = [
                                  + {
                                      + type  = "VCPU"
                                      + value = "2048"
                                    },
                                  + {
                                      + type  = "MEMORY"
                                      + value = "1"
                                    },
                                ]
                              + secrets              = []
                            },
                        ]
                      + executionRoleArn = "arn:aws:iam::891377385718:role/timezone-execution-role"
                      + platformVersion  = "LATEST"
                      + taskRoleArn      = "arn:aws:iam::891377385718:role/timezone-task-role"
                    },
                ]
            }
        )
      + id                         = (known after apply)
      + name                       = "timezone"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = false
      + region                     = "ap-northeast-1"
      + revision                   = (known after apply)
      + tags_all                   = (known after apply)
      + type                       = "container"
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"aws-plan","PRNumber":58,"Program":"tfcmt","SHA1":"d12975a6ac51de76e953c9eeccffbc500f6f73e7","Vars":{},"WorkflowName":"aws plan"} -->